*** Settings ***
Resource    ../../登录/公共的前置后置.resource
Resource    ../../页面对象层/日常运维/网元列表/网元列表页面操作.resource
Resource    ../../页面对象层/左侧菜单页面操作.resource
Resource    ../../页面对象层/日常运维/日志管理/安全日志页面操作.resource
Resource    ../../页面对象层/页面公共关键字.resource

Suite Setup    打开浏览器登录网管2-盲拖
Suite Teardown    关闭浏览器

*** Variables ***
${url}    https://192.168.123.13

*** Keywords ***
网元列表-CP/UP配置管理跳转
    [Arguments]    ${网元名称}    ${网元IP}
    进入网元列表二级菜单
    寻找UP/CP网元    网元名称=${网元名称}    网元IP=${网元IP}
    配置页面跳转

网元列表-CP/UP网元复位
    [Arguments]    ${网元名称}    ${网元IP}
    # ----- 前置：进入网元列表页面 -----
    进入网元列表二级菜单
    寻找UP/CP网元    网元名称=${网元名称}    网元IP=${网元IP}
    ${time}=    操作时间
    复位操作
    进入日志管理二级菜单
    安全日志列表断言    用户名称=admin@ailink.com    操作=复位    操作对象类别=系统    操作结果=成功    操作时间=${time}    第几条数据=1

网元列表-某类型网元增改查删
    [Arguments]    ${网元类型}    ${网元名称}
    # ----- 1.新增设备 -----
    进入网元列表二级菜单
    网元列表-新增网元
    ...    网元类型=${网元类型}
    ...    网元名称=${网元名称}
    ...    网元IP=192.168.123.12
    ...    网元版本=test
    网元列表-断言列表网元    网元名称=${网元名称}    expect=出现
    ${time}=    操作时间
    进入日志管理二级菜单
    进入操作日志三级菜单
    操作日志列表断言    操作=新增    操作对象类别=拓扑配置    操作结果=成功    操作时间=${time}    第几条数据=1
    网元列表-拓扑断言    网元名称=${网元名称}    expect=出现

    # ----- 2.编辑设备 -----
    进入网元列表二级菜单
    网元列表-修改网元    原网元名称=${网元名称}    新网元名称=-change
    网元列表-断言列表网元    网元名称=${网元名称}-change    expect=出现

    # ----- 3.删除设备 -----
    进入网元列表二级菜单
    网元列表-删除网元    网元名称=${网元名称}-change
    网元列表-断言列表网元    网元名称=${网元名称}-change    expect=不出现

*** Test Cases ***
网元列表的新增修改删除，操作日志验证-编号4392
    [Tags]    dyh    YES
    网元列表-某类型网元增改查删    网元类型=5GCUP    网元名称=testUP
    网元列表-某类型网元增改查删    网元类型=SWITCH    网元名称=testSW
